_org_posts/_posts/2021-12-28-boj-5430.org
#+HTML: ---
#+HTML: title: BOJ 5430 AC
#+HTML: tags: STL deque
#+HTML: ---
#+OPTIONS: ^:nil

** BOJ 5430 AC
- R : reverse 배열 뒤집기
- D : delete 맨 앞 요소 제거

** 접근하기
- 배열을 매번 reverse하는 것은 O(N)만큼 시간이 든다. -> 시간 초과가 날 것
- STL deque를 이용해서, front/back을 사용하도록 하면, reverse를 하지 않아도 된다는 점에 착안
#+BEGIN_EXAMPLE
#+END_EXAMPLE

** 코드 - STL deque 이용
#+BEGIN_SRC cpp
#include <cstdio>
#include <deque>
using namespace std;

int T;
char str[100010];
int N;
char arr[500000];

void solve()
{
    int mode = 0;   // 0 : 왼쪽 --> 오른쪽    1 : 오른쪽 --> 왼쪽
    scanf("%s", str);
    scanf("%d", &N);
    scanf("%s", arr);

    int num = 0;
    int idx = 0;
    int len = 0;
    for(;arr[len];len++);

    deque<int> dq;
    for(int i=1;i<len-1;i++) {
        if (arr[i] >= '0' && arr[i] <= '9') {
            num = num * 10 + (arr[i] - '0');
        } else {
            //a[idx++] = num;
            dq.push_back(num);
            num = 0;
        }
    }
    if (num) dq.push_back(num);  

    // R / D command를 반복
    for(int i=0;str[i];i++) {
        if (str[i] == 'R') {
            mode = (!mode) ? 1 : 0;
        } else if (str[i] == 'D') {
            if (mode == 0) {
                if (!dq.empty())
                    dq.pop_front();
                else {
                    printf("error\n");
                    return;
                }

            } else {
                if (!dq.empty())
                    dq.pop_back();
                else {
                    printf("error\n");
                    return;
                }
            }
        }
    }
    printf("[");
    int size = dq.size();
    if (mode == 0) {
        for(int i=0;i<size;i++) {
            printf("%d", dq.at(i));
            if (i<size-1)
            printf(",");
        }
        printf("]\n");
    } else {
        for(int i=size-1;i>=0;i--) {
            printf("%d", dq.at(i));
            if (i>0)
            printf(",");
        }
        printf("]\n");        
    }
}

int main(int argc, char* argv[])
{
    freopen("input2.txt", "r", stdin);
    scanf("%d", &T);
    for(int tc=1;tc<=T;tc++) {
        solve();
    }
    return 0;
}
#+END_SRC

** TODO 코드 - STL 없이 deque 만들기

** 문제 링크
- https://www.acmicpc.net/problem/5430
